{
    "class_name": "Model",
    "config": {
        "name": "model",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_2"
                },
                "name": "input_2",
                "inbound_nodes": []
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_7",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_7",
                "inbound_nodes": [
                    [
                        [
                            "input_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_8",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_8",
                "inbound_nodes": [
                    [
                        [
                            "dense_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_9",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_9",
                "inbound_nodes": [
                    [
                        [
                            "dense_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1
                },
                "name": "concatenate",
                "inbound_nodes": [
                    [
                        [
                            "dense_8",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_10",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_10",
                "inbound_nodes": [
                    [
                        [
                            "concatenate",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_11",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_11",
                "inbound_nodes": [
                    [
                        [
                            "dense_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_2",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_11",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.0-tf",
    "backend": "tensorflow"
}