{
  "class_name": "Model",
  "config": {
    "name": "model_2",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 784],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_4"
        },
        "name": "input_4",
        "inbound_nodes": []
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_23",
          "trainable": true,
          "dtype": "float32",
          "units": 128,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_23",
        "inbound_nodes": [[["input_4", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_24",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_24",
        "inbound_nodes": [[["dense_23", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_25",
          "trainable": true,
          "dtype": "float32",
          "units": 10,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_25",
        "inbound_nodes": [[["dense_24", 0, 0, {}]]]
      }
    ],
    "input_layers": [["input_4", 0, 0]],
    "output_layers": [["dense_25", 0, 0]]
  },
  "keras_version": "2.3.0-tf",
  "backend": "tensorflow"
}
